Revit 2025 API
LeadersPresentationMode Enumeration
 Leaders Presentation Mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum LeadersPresentationMode
Public Enumeration LeadersPresentationMode
public enum class LeadersPresentationMode
type LeadersPresentationMode
Members
Member name | Value | Description
ShowAll | 0 |  Show all tag leaders.
HideAll | 1 |  Hide all tag leaders.
ShowOnlyOne | 2 |  Show only one leader.
ShowSpecificLeaders | 3 |  Show specific leaders.
See Also
Reference
Autodesk.Revit.DB Namespace